
!Дано натуральное число. Напишите программу, которая определяет, является ли последовательность его цифр при просмотре справа налево упорядоченной по неубыванию.

```python
num = int(input())
flag = True
count = 0
while num > 0:
    last_digit = num % 10
    if last_digit > count:
        flag = True
        count = last_digit
    else:
        flag = False
    num //= 10
if flag == True:    
    print('YES')
else:
    print('NO')
```

Напишем программу, которая выводит все числа от 1 до 100, кроме чисел 7, 17, 29 и 78.

```python
for i in range(1, 101): 
	if i == 7 or i == 17 or i == 29 or i == 78: 
		continue # переходим на следующую итерацию 
	print(i)
```

Напишем программу, которая определяет, содержит ли введенное пользователем число цифру 7. Вместо программного кода, написанного ранее:

```python
num = int(input()) 
n = num 
flag = False 
while n != 0: 
	last = n % 10 
	if last == 7: 
		flag = True 
		break # прерываем цикл, так как число гарантированно содержит цифру 7 
	n //= 10 
if flag is True: 
	print('Число', num, 'содержит цифру 7') 
else: 
	print('Число', num, 'не содержит цифру 7')
```

Лучшей альтернативой будет:

```python
num = int(input()) 
n = num 
while n != 0: 
	last = n % 10 
	if last == 7: 
		print('Число', num, 'содержит цифру 7') 
		break n //= 10 
else: print('Число', num, 'не содержит цифру 7')
```


На обработку поступает последовательность из 10 целых чисел (каждое на отдельной строке). Нужно написать программу, которая выводит на экран количество неотрицательных чисел последовательности и их произведение. Если неотрицательных чисел нет, требуется вывести на экран «NO». 


```python
count = 0
proiz = 1
for _ in range(10):
    num = int(input())
    if num < 0:
        count += 1
        proiz *= num
if count > 0:
    print(count)
    print(proiz)
else:
    print('NO')
```



На обработку поступает последовательность из 10 целых чисел (каждое на отдельной строке). Известно, что вводимые числа по абсолютной величине не превышают 10^6. Нужно написать программу, которая выводит на экран сумму всех отрицательных чисел последовательности и максимальное отрицательное число в последовательности. Если отрицательных чисел нет, требуется вывести на экран «NO». Программист торопился и написал программу неправильно.

```python
# Инициализация переменных для суммы и максимального отрицательного числа
sum_negative = 0
max_negative = None

# Ввод последовательности из 10 чисел
for _ in range(10):
    num = int(input())
    if num < 0:
        # Если число отрицательное, добавляем его к сумме
        sum_negative += num
        # Если максимальное отрицательное число пока не определено или текущее число больше максимального,
        # то обновляем максимальное отрицательное число
        if max_negative is None or num > max_negative:
            max_negative = num

# Вывод результата
if max_negative is not None:
    print(sum_negative)
    print(max_negative)
else:
    print("NO")

```


На обработку поступает натуральное число. Нужно написать программу, которая выводит на экран максимальную цифру числа, кратную 3. Если в числе нет цифр, кратных 3, требуется на экран вывести «NO». 

```python
n = int(input())
max_digit = -1
while n > 0:
    digit = n % 10
    if digit % 3 == 0:
        if digit > max_digit:
            max_digit = digit
    n = n // 10
if max_digit >= 0:
    print(max_digit)
else:
    print('NO')

```



Предположим, что мы хотим напечатать на экране звездочки в виде прямоугольной таблицы.

```python
for i in range(8):
    for j in range(6):
        print('*', end='')
    print()

```

В этой комбинации всего восемь строк. В первой строке один столбец. Во второй строке – два столбца. В третьей строке – три. И так продолжается до восьмой строки, в которой восемь столбцов.

```python
for i in range(8):
    for j in range(i + 1):
        print('*', end='')
    print()
```

Дано нечетное натуральное число 𝑛. Напишите программу, которая печатает равнобедренный звездный треугольник с основанием, равным 𝑛 в соответствии с примером:

*
**
***
**
*

```python
n = int(input())
for i in range(1, n//2 + 2):
    print('*' * i)
    # Нижняя часть треугольника
for i in range(n//2, 0, -1):
    print('*' * i)
```


Дано натуральное число n. Напишите программу, которая печатает численный треугольник с высотой равной n, в соответствии с примером:
1 
121 
12321 
1234321 
123454321

```python
n = int(input())
for i in range(1, n + 1):
    for j in range(i):
        print(j + 1, end=' ')
    for k in range(i - 1, 0, -1):
        print(k, end=' ')
    print()

```


На вход программе подается два натуральных числа a и b (a< b). Напишите программу, которая находит натуральное число из отрезка [a;b] с максимальной суммой делителей и сумму его делителей. Если таких чисел несколько, то выведите наибольшее из них.

```python
a,b  = int(input()), int(input())
count = 0
largets = 0
for i in range(a, b + 1):
    total = 0
    for j in range(1, i + 1):
        if i % j == 0:
            total += j
        if total >= count and i >= largets:
            count = total
            largets = i
print(largets,count)
```

На вход программе подается натуральное число n. Напишите программу, которая печатает звездную рамку размерами n×19.

```python
n = int(input())
for j in range(n):
    if j == 0 or j == n - 1: 
        print('*'*19)
    else:
        print('*','*', sep=" "*17)
```